{
  "weights_path": "Absolute path to the YOLO pose model (.pt, .onnx, etc.) you want to run. Choose the file exported from training.",
  "save_dir": "Folder where SimBA will write the tracked pose CSV files. Leave blank to keep results in memory only.",
  "bp_config_csv_path": "CSV listing body-part names in the order expected by the model. Each name on its own line (e.g., Nose, LeftEar, ...).",
  "batch_dropdown": "Number of frames processed at once. Larger batches speed up inference but require more GPU RAM.",
  "verbose_dropdown": "Toggle console printouts for progress and timings. Keep TRUE while tuning, FALSE for quiet runs.",
  "workers_dropdown": "How many CPU worker threads to use for pre/post-processing. Set <= available cores.",
  "format_dropdown": "Model serialization format (None = auto-detect from file extension). Match the format used when exporting the weights.",
  "img_size_dropdown": "Resize shorter image side to this many pixels before inference. Larger sizes improve accuracy but slow down processing.",
  "devices_dropdown": "Compute device to run on. Select CUDA device ID for GPU or CPU.",
  "interpolate_dropdown": "Fill missing detections by interpolating coordinates over time. Recommended for cleaner trajectories.",
  "stream_dropdown": "Enable streaming inference which reads frames sequentially (lower memory footprint). Disable for random seeking.",
  "threshold_dropdown": "Minimum detection confidence to keep. Lower values detect more poses but introduce more false positives.",
  "iou_dropdown": "Minimum bounding-box overlap required to keep the same track between frames. Higher values demand tighter alignment.",
  "max_tracks_dropdown": "Maximum number of simultaneous object tracks the model can follow in each frame.",
  "max_track_per_id_dropdown": "Cap on how many concurrent tracks a single class ID (e.g., a specific animal) can occupy.",
  "smoothing_dropdown": "Apply temporal smoothing over this many milliseconds to reduce jitter in keypoint trajectories.",
  "recursive_dropdown": "If False, only analyses videos in the immediate parent folder. If True, searches all sub-directories as well.",
  "CPU_ROI_DESCRIPTIVE_ANALYSIS": "If few videos (<1000), consider single CPU. If more videos (>1000), consider higher CPU count for acceptable speed.",
  "CPU_TIMEBINS_MOVEMENT": "If the total number of time bins over all videos is expected to be many (1000+), consider higher CPU count (>1) for acceptable speed.",
  "SHOW_ANIMAL_BBOX": "Display rectangle bounding boxes encompassing all animal keypoints",
  "BORDER_BG_COLOR": "The color of the border image on which data is printed",
  "USE_GPU": "If GPU available and selected, then potentially faster processing times.",
  "OUPUT_VIDEO_QUALITY": "Higher values produce larger, higher quality, videos. Lower values produce smaller, lower quality videos. \nScale not linear. Avoid values above 80 if possible. 60 generally works well.",
  "VIDEO_SPEED": "2 doubles the speed, while 0.5 halves the speed.",
  "VIDEO_CODEC": "Video codec to use for encoding. Common options include libx264 (CPU, widely compatible), h264_nvenc (NVIDIA GPU), libx265 (CPU, better compression), and libvpx-vp9 (CPU, web optimized). Codec availability depends on your FFmpeg installation.",
  "BLOB_TRACK_THRESHOLD": "Foreground threshold (1-100). Higher values are stricter and may reduce noise but risk missing faint blobs; lower values detect more but can increase noise. Applied to all videos via quick settings.",
  "BLOB_SMOOTHING_TIME": "Temporal smoothing window in seconds applied to all videos via quick settings. 'None' keeps per-video values; higher values smooth jitter but can blur brief movement details.",
  "BLOB_BUFFER_PIXELS": "Optional pixel buffer applied in quick settings. Expands the area considered around detections/ROIs. 'None' leaves per-video values unchanged.",
  "BLOB_CLOSE_KERNEL": "Gap-fill filter size (% of max frame dimension). Larger values close larger holes between foreground pixels. Set to 'None' to skip closing.",
  "BLOB_OPEN_KERNEL": "Noise removal (morphological opening) filter size expressed as percent of the maximum frame dimension. Larger values remove more small speckles. 'None' disables opening.",
  "BLOB_BG_DIR": "Folder with background reference videos matching each input video name and resolution. Required for background subtraction.",
  "BLOB_CORE_COUNT": "CPU cores to use for blob tracking. Higher values speed up processing but increase CPU/RAM memory load.",
  "BLOB_VERTICE_COUNT": "Number of vertices (points) to detect around animal outer bounds. Higher values give finer detail but may slow processing.",
  "BLOB_SAVE_BG_VIDEOS": "Save generated background videos alongside results. Disable to save disk space.",
  "BLOB_CLOSE_ITERATIONS": "Number of iterations for morphological closing (gap filling). Higher values close larger gaps.",
  "BLOB_OPEN_ITERATIONS": "Number of iterations for morphological opening (noise removal). Higher values remove more small speckles.",
  "BLOB_DUPLICATE_INCLUSION": "Copy inclusion zones defined for one video to all other videos. Requires existing inclusion zone definitions."
}